#+title: r/roguelikedev summer tutorial
#+date: <2020-06-18 Thu>
#+options: toc:nil

#+begin_comment


NOTE: this org file acted as my "diary". I exported it to html:

https://www.redblobgames.com/x/2025-roguelike-dev/


I don't expect that the org file itself will be useful to you, as it uses features that are only in my custom version of emacs. However, the html+js should work on its own.

#+end_comment


I had previously followed the r/roguelikedev summer tutorial series, but never finished.
I'm trying again this year, using [[https://ondras.github.io/rot.js/hp/][rot.js]] this time.

#+include: "game.html" export html

Source code: [[href:game.html][game.html]] + [[href:roguelike-dev.js][roguelike-dev.js]] (no build step) - and [[https://github.com/redblobgames/2025-roguelikedev][on github]].

My goal is /not/ to implement my own features, but instead focus on only the features from the Python + tcod tutorial, implementing them in JavaScript + browser + rot.js instead. I'm willing to implement the data structures, code style, etc., differently from the tutorial to better fit JavaScript and my own coding style. However, every time I think of a /game feature/ I'd like to add or do differently, I add it to a text file somewhere, and then I can come back to it /after/ I finish the tutorial.

** Player levels

The tutorial uses a Level component with =level_up_base= set to 200 and =level_up_factor= set to 150. I don't see myself varying these per instance, so I'm going to express this instead as a function that calculates the xp needed to reach a specific level. The tutorial has =current_xp= reset every time you gain a level. I'm going to have it always go up.

The formula is encoded in this code:

#+begin_src python
@property
def experience_to_next_level(self):
    return self.level_up_base + self.current_level * self.level_up_factor
#+end_src

Let's see what that looks like:

| current_level | experience_to_next_level | total xp |
|---------------+--------------------------+----------|
|             1 |                      350 |      350 |
|             2 |                      500 |      850 |
|             3 |                      650 |     1500 |
|             4 |                      800 |     2300 |
|             5 |                      950 |     3250 |
|             6 |                     1100 |     4350 |
|             7 |                     1250 |     5600 |
|             8 |                     1400 |     7000 |
|             9 |                     1550 |     8550 |
|            10 |                     1700 |    10250 |
#+TBLFM: $1=@#-1
#+TBLFM: $2=200+$1*150
#+TBLFM: $3=vsum(@I$2..$2)

Is there a compact formula for the total xp column? /Yes/: it simplifies to ~200 * N + 150 * (N * (N+1)) / 2~, where =N= is the current level. When we get past that amount, it's time to level up.

#+begin_src js
function xpForLevel(level) {
    return 200 * level + 150 * (level * (level+1)) / 2;
}
#+end_src

Now the player can level up with this code:

#+begin_src js
function gainXp(entity, amount) {
    if (!entity.xp) { return; } // this entity doesn't gain experience
    entity.xp += amount;
    if (entity.id !== player.id) { throw `XP for non-player not implemented`; }
    print(`You gain ${amount} experience points.`, 'info');
    while (entity.xp > xpForLevel(entity.level)) {
        entity.level += 1;
        print(`Your battle skills grow stronger! You reached level ${entity.level}!`, 'warning');
        // TODO: let player choose an upgrade
    }
}
#+end_src

